In [5]:
import pandas as pd
import mysql.connector

In [6]:
connection = mysql.connector.connect(host='localhost', 
                                    username = 'root',
                                    password = '1234',
                                    db = 'jdbc_test')

In [7]:
connection

In [9]:
emp_table = pd.read_sql_query('SHOW TABLES FROM jdbc_test', connection)

In [10]:
emp_table

  Tables_in_jdbc_test
0            employee